Ran Plan for project: `netology` dir: `.` workspace: `default`

<details><summary>Show Output</summary>

```diff

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create

Terraform will perform the following actions:

  # yandex_compute_image.ubuntu-image will be created
+ resource "yandex_compute_image" "ubuntu-image" {
      + created_at      = (known after apply)
      + folder_id       = (known after apply)
      + id              = (known after apply)
      + min_disk_size   = (known after apply)
      + name            = "my-ubuntu-image"
      + os_type         = (known after apply)
      + pooled          = (known after apply)
      + product_ids     = (known after apply)
      + size            = (known after apply)
      + source_disk     = (known after apply)
      + source_family   = (known after apply)
      + source_image    = "fd8f1tik9a7ap9ik2dg1"
      + source_snapshot = (known after apply)
      + source_url      = (known after apply)
      + status          = (known after apply)
    }

  # yandex_compute_instance.vm-1 will be created
+ resource "yandex_compute_instance" "vm-1" {
      + created_at                = (known after apply)
      + description               = "First test instance"
      + folder_id                 = (known after apply)
      + fqdn                      = (known after apply)
      + hostname                  = "vm-1"
      + id                        = (known after apply)
      + metadata                  = {
          + "ssh-keys" = <<-EOT
                ubuntu:ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABgQDI/vPfmIh7EOplOLhVkgqXYiq+vJbTZH4KmtIhpOd2evgh8v19dD5kFsTnIYzGIPaoVUhsnY32g5ACJnIOwzejBwxqQejbimD6839ZfUOLEqlXSU5NIpzFTl/T9Q6BX1BKtnWX9At0ua+emdo2T2WMCnBypc0iJwyPzddes90kgHSM9INIHzzNu4nAlSiAb7awCxEwLc7sG+UfjTY42JkUf/lPTSL0pRl66mOd68vjqYZ0mL28GKXQ6ButP9rHNB7MLupqBxp8suajsv2QsSH92kNkxECqTs0nodVEsVAP/gBKOpknyMxAvPiQRUfRIPlO0+qDFY212gN2vjYVoUkog6h+h01Ff2V7A9/QyQSEK07Kq0MLEd50XUbvCJVVGh8tMKQaRDlnxQY/zoA/j52tdnSn1GT6xOQsUtBXGsaxe+z/eh4FzccDjzZ9Eecgt+LELN1c/rFxKsmH3RZ5QMxIJNw7mCGutKhJM3Q/s7dZ0g7yI5ScX0QcINB9WuqZwyE= dimka@dmhome
            EOT
        }
      + name                      = "terraform7.4-atl"
      + network_acceleration_type = "standard"
      + platform_id               = "standard-v1"
      + service_account_id        = (known after apply)
      + status                    = (known after apply)
      + zone                      = (known after apply)

      + boot_disk {
          + auto_delete = true
          + device_name = (known after apply)
          + disk_id     = (known after apply)
          + mode        = (known after apply)

          + initialize_params {
              + block_size  = (known after apply)
              + description = (known after apply)
              + image_id    = (known after apply)
              + name        = "root-vm-1"
              + size        = 50
              + snapshot_id = (known after apply)
              + type        = "network-nvme"
            }
        }

      + network_interface {
          + index              = (known after apply)
          + ip_address         = (known after apply)
          + ipv4               = true
          + ipv6               = (known after apply)
          + ipv6_address       = (known after apply)
          + mac_address        = (known after apply)
          + nat                = true
          + nat_ip_address     = (known after apply)
          + nat_ip_version     = (known after apply)
          + security_group_ids = (known after apply)
          + subnet_id          = "e9b17r3b387ge21o7rd2"
        }

      + placement_policy {
          + host_affinity_rules = (known after apply)
          + placement_group_id  = (known after apply)
        }

      + resources {
          + core_fraction = 5
          + cores         = 2
          + memory        = 2
        }

      + scheduling_policy {
          + preemptible = (known after apply)
        }
    }

Plan: 2 to add, 0 to change, 0 to destroy.

Changes to Outputs:
+ external_ip_address_vm-1_yandex_cloud = (known after apply)
+ internal_ip_address_vm-1_yandex_cloud = (known after apply)

```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -p netology`
* :put_litter_in_its_place: To **delete** this plan click [here](http://atlantis:4141/lock?id=DmShcherbakov%252Fterraform-7.2%252F.%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -p netology`
</details>
Plan: 2 to add, 0 to change, 0 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
* :put_litter_in_its_place: To delete all plans and locks for the PR, comment:
    * `atlantis unlock`
